app/Controllers/Football.php

    public function createPertandingan()
    {
        return view('football/input_skor', [
            'title' => 'Input Data Pertandingan',
            'klubs' => $this->klubModel->findAll(),
---
SELECT *
FROM `klub`

    public function viewKlasemen()
    {
        // Ambil data klub dan hitung statistiknya
        $klubs = $this->klubModel->findAll();
        $klasemen = [];

        foreach ($klubs as $klub) {
            // Inisialisasi statistik
            $played = 0;
            $won = 0;
            $drawn = 0;
            $lost = 0;
            $homeGoalsScored = 0;
            $homeGoalsConceded = 0;
            $awayGoalsScored = 0;
            $awayGoalsConceded = 0;

            // Ambil pertandingan tim sebagai tim kandang
            $homeMatches = $this->pertandinganModel->where('klub_home', $klub['id'])->findAll();
---
SELECT *
FROM `klub`
SELECT *
FROM `pertandingan`
WHERE `klub_home` = '4'

            }

            // Ambil pertandingan tim sebagai tim tandang
            $awayMatches = $this->pertandinganModel->where('klub_away', $klub['id'])->findAll();
---
SELECT *
FROM `pertandingan`
WHERE `klub_away` = '4'